// var coffeeShop = {
//     coffee1: {
//         coffee: 'cappuccino',
//         description: 'CAPPUCCINO: кофе, сливки. Итальянская версия напитка с преобладанием горячих вспененных сливок. Мягкая палитра с оттенком настоящего эспрессо из зерен сильной обжарки.'
//     },
//     coffee2: {
//         coffee:'Latte',
//         description: 'Латте — самый большой и самый молочный кофейный напиток на основе эспрессо. Подойдёт для тех, кто не любит яркий вкус кофе.',
//         description2: 'Его готовят в чашку объёмом 250–300 мл и используют одну порцию эспрессо. Остальной объем напитка составляет молоко и немного молочной пены.'
//     },
//     coffee3: {
//         coffee: 'Espresso',
//         description: 'espresso) — метод приготовления кофе путём прохождения горячей воды (92-96 °C) под давлением (около 9 бар) через фильтр с молотым кофе.',
//         description2: ' Эспрессо пользуется большой популярностью во всём мире и, прежде всего, на юге Европы — в Италии, Испании и Португалии.'
//     },
//     coffee4: {
//         coffee: 'Americano',
//         description: 'Американо — это эспрессо с добавлением горячей воды. Допускается разбавление эспрессо водой в соотношении 1:1, 1:2 или 1:4.',
//         description2: ' Классическая пропорция — 1:1, но вы можете приготовить американо так, как вам нравится. Чем больше воды, тем менее концентрированным получится напиток.'
//     },
//     coffee5: {
//         coffee: 'Iced coffee',
//         description: 'Все просто – это любой кофейный напиток в который мы добавляем лед: Cold Brew. Колд брю заваривается в холодильнике от 8 до 12 часов, при подаче добавляется лед.',
//         description2: ' Кофе, приготовленный любым способом, поданный со льдом, также будет считаться Айс Кофе'
//     },
// };
// console.log(Object.values(coffeeShop))

//*************************

// var array = ['Bishkek', 'Los Angeles', 'Chicago', 'New York', 'Houstan', 'Dallas', 'Philadelphia', 'Seattle']
//
// for (var i = 0; i < array.length; i++) {
//     if (array[i].length > '7') {
//         console.log(`Город у которого больше 7 символов ${array[i]}`)
//     }
// }

//**************************

// var day = Number(prompt('Введите число от 1 до 7'))
//
// switch (day) {
//     case 1:
//         alert('Понедельник')
//         break
//     case 2:
//         alert('Вторник')
//         break
//     case 3:
//         alert('Среда')
//         break
//     case 4:
//         alert('Четверг')
//         break
//     case 5:
//         alert('Пятница')
//         break
//     case 6:
//         alert('Суббота')
//         break
//     case 7:
//         alert('Воскресенье')
//         break
//     default:
//         console.error('error!!! Вы точно ввели число от 1 до 7 ?')
// }